I can confirm that changing:

  ```
    if mapTmp["session-ttl"] != nil {
                        output.SessionTTL = strconv.Itoa(int(mapTmp["session-ttl"].(float64)))
     }
```
to:

  ```
    if mapTmp["session-ttl"] != nil {
                       output.SessionTTL = mapTmp["session-ttl"].(string)
   }
```
in https://github.com/terraform-providers/terraform-provider-fortios/blob/master/vendor/github.com/fortinetdev/forti-sdk-go/fortios/sdkcore/firewall_object_service.go#L301

fixes the issue for me and the resource is created/modified successfully:
Terraform will perform the following actions:

```
  # module.services.fortios_firewall_object_service.v13 will be created
  + resource "fortios_firewall_object_service" "v13" {
      + category        = "TDC AD/DC Auth & Connectivity"
      + comment         = "comment"
      + fqdn            = (known after apply)
      + icmpcode        = (known after apply)
      + icmptype        = (known after apply)
      + id              = (known after apply)
      + iprange         = "1.1.1.1-2.2.2.2"
      + name            = "servicetest2"
      + protocol        = "TCP/UDP/SCTP"
      + protocol_number = (known after apply)
      + sctp_portrange  = "66-88"
      + session_ttl     = "0"
      + tcp_portrange   = "22-33"
      + udp_portrange   = "44-55"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

$terraform apply

module.services.fortios_firewall_object_service.v13: Creating...
module.services.fortios_firewall_object_service.v13: Creation complete after 0s [id=servicetest2]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Modifying with value bigger than 300 according to FortiOS API docs:

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.services.fortios_firewall_object_service.v13 will be updated in-place
  ~ resource "fortios_firewall_object_service" "v13" {
        category       = "TDC AD/DC Auth & Connectivity"
        comment        = "comment"
        id             = "servicetest2"
        iprange        = "1.1.1.1-2.2.2.2"
        name           = "servicetest2"
        protocol       = "TCP/UDP/SCTP"
        sctp_portrange = "66-88"
      ~ session_ttl    = "0" -> "600"
        tcp_portrange  = "22-33"
        udp_portrange  = "44-55"
    }

Plan: 0 to add, 1 to change, 0 to destroy.

$terraform apply

module.services.fortios_firewall_object_service.v13: Modifying... [id=servicetest2]
module.services.fortios_firewall_object_service.v13: Modifications complete after 0s [id=servicetest2]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```